app/controllers/employees_controller.rb

INSERT INTO "employees" ("employee_id", "employee_name", "employee_email", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["employee_id", 21223], ["employee_name", "Santosh"], ["employee_email", "santosh.turamari@hpe.com"], ["created_at", 2017-04-04 16:34:23 UTC], ["updated_at", 2017-04-04 16:34:23 UTC]]
INSERT INTO "projects" ("name", "employee_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Quantum"], ["employee_id", 1], ["created_at", 2017-04-04 16:34:23 UTC], ["updated_at", 2017-04-04 16:34:23 UTC]]
SELECT  "projects".* FROM "projects" WHERE "projects"."employee_id" = $1 ORDER BY "projects"."id" DESC LIMIT $2  [["employee_id", 1], ["LIMIT", 1]]
INSERT INTO "tasks" ("activity", "status", "duration", "project_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["activity", "Analyzing the requirement"], ["status", "WIP"], ["duration", 1], ["project_id", 1], ["created_at", 2017-04-04 16:34:23 UTC], ["updated_at", 2017-04-04 16:34:23 UTC]]
---
	def create
		@employee = Employee.new(employee_params)

		if @employee.save
			ActiveRecord::Base.transaction do
				projects_attributes = employee_params[:projects_attributes][0]
				task_attributes = projects_attributes[:tasks_attributes]

				@employee.projects.build(projects_attributes)
				@employee.save

				@employee.projects.last.tasks.build(task_attributes)
				@employee.save