app/controllers/employees_controller.rb

	def index
		@employees = Employee.all
---
SELECT "employees".* FROM "employees" WHERE (DATE(created_at) = '2017-04-08')